# SketchedStairsCurveData Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
SketchedStairsCurveData Class
Members See Also
---
Sketched run/landing curves overrides with height and slope
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public class SketchedStairsCurveData : IDisposable
```

Visual Basic
---
```text
Public Class SketchedStairsCurveData _
	Implements IDisposable
```

Visual C++
---
```text
public ref class SketchedStairsCurveData : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..SketchedStairsCurveData
# See Also
SketchedStairsCurveData Members
Autodesk.Revit.DB Namespace